export module hu.test.impl.TestLog;


////////////////////////////////////////////////////////////////////////////////////////////////////
// TODO: Import (TestLog)
////////////////////////////////////////////////////////////////////////////////////////////////////

import hu.log.Log;
import hu.Type;

import "hu/log/LogMacro.hpp";


////////////////////////////////////////////////////////////////////////////////////////////////////
// TODO: Function (TestLog)
////////////////////////////////////////////////////////////////////////////////////////////////////

export bool test_log()
{
    for ( auto i = 0; i < 10; ++i )
    {
        // 디버그로 영문을 출력한다.
        HU_LOG_DEBUG( _T( "Log" ), _T( "Locale is {}." ), _T( "UTF16" ) );
        HU_LOG_NDEBUG( _T( "Locale is {}." ), _T( "UTF16" ) );

        // 정보로 한글을 출력한다.
        HU_LOG_INFO( _T( "Log" ), _T( "로케일은 {} 입니다." ), _T( "UTF16" ) );
        HU_LOG_NINFO( _T( "로케일은 {} 입니다." ), _T( "UTF16" ) );

        // 경고로 중국어 간체를 출력한다.
        HU_LOG_WARN( _T( "Log" ), _T( "语言设置为 {}" ), _T( "UTF16" ) );
        HU_LOG_NWARN( _T( "语言设置为 {}" ), _T( "UTF16" ) );

        // 오류로 일본어를 출력한다.
        HU_LOG_ERROR( _T( "Log" ), _T( "ロケールは {} です。" ), _T( "UTF16" ) );
        HU_LOG_NERROR( _T( "ロケールは {} です。" ), _T( "UTF16" ) );
    }

    return true;
}
